podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: GPIOC_0              = PTC0(p43)                      */  { PortCInfo,  0,            (PcrValue)0x08100UL  },
         /*   1: GPIOC_1              = PTC1(p44)                      */  { PortCInfo,  1,            (PcrValue)0x08100UL  },
         /*   2: GPIOC_2              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: GPIOC_3              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: GPIOC_4              = PTC4(p49)                      */  { PortCInfo,  4,            (PcrValue)0x08100UL  },
         /*   5: GPIOC_5              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: GPIOC_6              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: GPIOC_7              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: GPIOC_8              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: GPIOC_9              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: GPIOC_10             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: GPIOC_11             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: GPIOC_12             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  13: GPIOC_13             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: GPIOC_14             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: GPIOC_15             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  16: GPIOC_16             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  17: GPIOC_17             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  18: GPIOC_18             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  19: GPIOC_19             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK);
#endif

PORTC->GPCLR = 0x8100UL|PORT_GPCLR_GPWE(0x0013UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK);
#endif

PORTC->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

#define USBDM_GPIOD_IS_DEFINED
/**
 * Peripheral information for GPIO, Digital Input/Output.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
/* gpio_def.xml */

#if defined(PCC_PCC_PORTD_CGC_MASK)
   /** Port information for PORTD */
   constexpr PortInfo  __attribute__((unused)) PortDInfo {PORTD_BasePtr, static_cast<uint32_t>(PCC_BasePtr+offsetof(PCC_Type, PCC_PORTD)), PORTD_IRQn, GPIOD_BasePtr, NvicPriority_Normal};
#elif defined(SIM_SCGC5_PORTD_MASK)
#ifndef PORTD_IRQS
   /** Port information for PORTD */
   constexpr PortInfo  __attribute__((unused)) PortDInfo {PORTD_BasePtr, SIM_SCGC5_PORTD_MASK, IRQn_None, GPIOD_BasePtr, NvicPriority_Normal};
#else
   constexpr IRQn_Type PORTD_IRQS_AR[] = PORTD_IRQS;
   /** Port information for PORTD */
   constexpr PortInfo  __attribute__((unused)) PortDInfo {PORTD_BasePtr, SIM_SCGC5_PORTD_MASK, PORTD_IRQS_AR[0], GPIOD_BasePtr, NvicPriority_Normal};
#endif
#endif

class GpioDInfo {
public:
   // Template:gpioa_0x400ff000

   //! Number of signals available in info table
   static constexpr int numSignals  = 16;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: GPIOD_0              = PTD0(p57)                      */  { PortDInfo,  0,            (PcrValue)0x08100UL  },
         /*   1: GPIOD_1              = PTD1(p58)                      */  { PortDInfo,  1,            (PcrValue)0x08100UL  },
         /*   2: GPIOD_2              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: GPIOD_3              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: GPIOD_4              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: GPIOD_5              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: GPIOD_6              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: GPIOD_7              = PTD7(p64)                      */  { PortDInfo,  7,            (PcrValue)0x08100UL  },
         /*   8: GPIOD_8              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: GPIOD_9              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: GPIOD_10             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: GPIOD_11             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: GPIOD_12             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  13: GPIOD_13             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: GPIOD_14             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: GPIOD_15             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

