podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
   #if defined(SIM_SOPT4_FTM3TRG0SRC)
   /**
    * FlexTimer 3 Hardware Trigger 0 Source Select
    */
   enum SimFtm3Trg0Src {
      SimFtm3Trg0Src_Reserved = SIM_SOPT4_FTM3TRG0SRC(0),//!< Reserved
      SimFtm3Trg0Src_Ftm1     = SIM_SOPT4_FTM3TRG0SRC(1),//!< Ftm1 channel match
   };
   #endif

   #if defined(SIM_SOPT4_FTM0TRG1SRC)
   /**
    * FlexTimer 0 Hardware Trigger 1 Source Select
    */
   enum SimFtm0Trg1Src {
      SimFtm0Trg1Src_Pdb0 = SIM_SOPT4_FTM0TRG1SRC(0),//!< Pdb0 output
      SimFtm0Trg1Src_Ftm2 = SIM_SOPT4_FTM0TRG1SRC(1),//!< Ftm2 channel match
   };
   #endif

   #if defined(SIM_SOPT4_FTM0TRG0SRC)
   /**
    * FlexTimer 0 Hardware Trigger 0 Source Select
    */
   enum SimFtm0Trg0Src {
      SimFtm0Trg0Src_Cmp0 = SIM_SOPT4_FTM0TRG0SRC(0),//!< Cmp0 output
      SimFtm0Trg0Src_Ftm1 = SIM_SOPT4_FTM0TRG0SRC(1),//!< Ftm1 channel match
   };
   #endif

   #if defined(SIM_SOPT4_FTM3CLKSEL)
   /**
    * FTM3 External Clock Pin Select
    *
    * Selects the external pin used to drive the clock to the FTM3 module.
    * NOTE: The selected pin must also be configured for the FTM external clock function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm3ClkSel {
      SimFtm3ClkSel_FtmClk0 = SIM_SOPT4_FTM3CLKSEL(0),//!< FtmClk0 pin
      SimFtm3ClkSel_FtmClk1 = SIM_SOPT4_FTM3CLKSEL(1),//!< FtmClk1 pin
   };
   #endif

   #if defined(SIM_SOPT4_FTM2CLKSEL)
   /**
    * FTM2 External Clock Pin Select
    *
    * Selects the external pin used to drive the clock to the FTM2 module.
    * NOTE: The selected pin must also be configured for the FTM external clock function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm2ClkSel {
      SimFtm2ClkSel_FtmClk0 = SIM_SOPT4_FTM2CLKSEL(0),//!< FtmClk0 pin
      SimFtm2ClkSel_FtmClk1 = SIM_SOPT4_FTM2CLKSEL(1),//!< FtmClk1 pin
   };
   #endif

   #if defined(SIM_SOPT4_FTM1CLKSEL)
   /**
    * FTM1 External Clock Pin Select
    *
    * Selects the external pin used to drive the clock to the FTM1 module.
    * NOTE: The selected pin must also be configured for the FTM external clock function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm1ClkSel {
      SimFtm1ClkSel_FtmClk0 = SIM_SOPT4_FTM1CLKSEL(0),//!< FtmClk0 pin
      SimFtm1ClkSel_FtmClk1 = SIM_SOPT4_FTM1CLKSEL(1),//!< FtmClk1 pin
   };
   #endif

   #if defined(SIM_SOPT4_FTM0CLKSEL)
   /**
    * FlexTimer 0 External Clock Pin Select
    *
    * Selects the external pin used to drive the clock to the FTM0 module.
    * NOTE: The selected pin must also be configured for the FTM external clock function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm0ClkSel {
      SimFtm0ClkSel_FtmClk0 = SIM_SOPT4_FTM0CLKSEL(0),//!< FtmClk0 pin
      SimFtm0ClkSel_FtmClk1 = SIM_SOPT4_FTM0CLKSEL(1),//!< FtmClk1 pin
   };
   #endif

   #if defined(SIM_SOPT4_FTM2CH0SRC)
   /**
    *  FTM2 channel 0 input capture source select
    *  
    *  Selects the source for FTM2 channel 0 input capture.
    *  NOTE: When the FTM is not in input capture mode, clear this field.
    */
   enum SimFtm2Ch0Src {
      SimFtm2Ch0Src_Ftm2Ch0  = SIM_SOPT4_FTM2CH0SRC(0),//!< Ftm2Ch0 pin
      SimFtm2Ch0Src_Cmp0     = SIM_SOPT4_FTM2CH0SRC(1),//!< Cmp0 output
      SimFtm2Ch0Src_Cmp1     = SIM_SOPT4_FTM2CH0SRC(2),//!< Cmp1 output
      SimFtm2Ch0Src_Reserved = SIM_SOPT4_FTM2CH0SRC(3),//!< Reserved 
   };
   #endif

   #if defined(SIM_SOPT4_FTM2CH1SRC)
   /**
    *  FTM2 channel 1 input capture source select
    *  
    *  Selects the source for FTM2 channel 1 input capture.
    *  NOTE: When the FTM is not in input capture mode, clear this field.
    */
   enum SimFtm2Ch1Src {
      SimFtm2Ch1Src_Ftm2Ch0  = SIM_SOPT4_FTM2CH1SRC(0),//!< Ftm2Ch1 pin
      SimFtm2Ch1Src_Xor3Ftm  = SIM_SOPT4_FTM2CH1SRC(1),//!< XOR of FTM2_CH1, FTM2_CH0 and FTM1_CH1.
   };
   #endif

   #if defined(SIM_SOPT4_FTM1CH0SRC)
   /**
    *  FTM1 channel 0 input capture source select
    *  
    *  Selects the source for FTM1 channel 0 input capture.
    *  NOTE: When the FTM is not in input capture mode, clear this field.
    */
   enum SimFtm1Ch0Src {
      SimFtm1Ch0Src_Ftm1Ch0 = SIM_SOPT4_FTM1CH0SRC(0),//!< Ftm1Ch0
      SimFtm1Ch0Src_Cmp0    = SIM_SOPT4_FTM1CH0SRC(1),//!< Cmp0 output
      SimFtm1Ch0Src_Cmp1    = SIM_SOPT4_FTM1CH0SRC(2),//!< Cmp1 output
      SimFtm1Ch0Src_UsbSof  = SIM_SOPT4_FTM1CH0SRC(3),//!< USB SOF 
   };
   #endif

   #if defined(SIM_SOPT4_FTM3FLT0)
   /**
    * FTM3 Fault 0 Select
    * 
    * Selects the source of FTM3 fault 0.
    * NOTE: The pin source for fault 0 must be configured for the FTM module fault function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm3Flt0 {
      SimFtm3Flt0_Ftm2Flt0 = SIM_SOPT4_FTM3FLT0(0),//!< FTM3 Fault 0 pin
      SimFtm3Flt0_Cmp0     = SIM_SOPT4_FTM3FLT0(1),//!< Cmp0 output
   };
   #endif

   #if defined(SIM_SOPT4_FTM2FLT0)
   /**
    * FTM2 Fault 0 Select
    * 
    * Selects the source of FTM2 fault 0.
    * NOTE: The pin source for fault 0 must be configured for the FTM module fault function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm2Flt0 {
      SimFtm2Flt0_Ftm2Flt0 = SIM_SOPT4_FTM2FLT0(0),//!< FTM2 Fault 0 pin
      SimFtm2Flt0_Cmp0     = SIM_SOPT4_FTM2FLT0(1),//!< Cmp0 output
   };
   #endif

   #if defined(SIM_SOPT4_FTM1FLT0)
   /**
    * FTM1 Fault 0 Select
    * 
    * Selects the source of FTM1 fault 0.
    * NOTE: The pin source for fault 0 must be configured for the FTM module fault function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm1Flt0 {
      SimFtm1Flt0_Ftm1Flt0 = SIM_SOPT4_FTM1FLT0(0),//!< FTM1 Fault 0 pin
      SimFtm1Flt0_Cmp0     = SIM_SOPT4_FTM1FLT0(1),//!< Cmp0 output
   };
   #endif

   #if defined(SIM_SOPT4_FTM0FLT2)
   /**
    * FTM0 Fault 2 Select
    * 
    * Selects the source of FTM0 fault 2.
    * NOTE: The pin source for fault 2 must be configured for the FTM module fault function through the
    * appropriate pin control register in the port control module.
    */
   enum SimFtm0Flt2 {
      SimFtm0Flt2_Ftm0Flt2 = SIM_SOPT4_FTM0FLT2(0),//!< FTM0 Fault 2 pin
      SimFtm0Flt2_Cmp2     = SIM_SOPT4_FTM0FLT2(1),//!< Cmp2 output
   };
   #endif

