podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
   #ifdef SIM_SOPT2_SDHCSRC
   /**
    * Set SDHC input clock source
    *
    * @param simSdhcClockSource Clock source for SDHC
    */
   static void setSdhcClock(SimSdhcClockSource simSdhcClockSource) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_SDHCSRC_MASK) | simSdhcClockSource;
   }

   /**
    * Get SDHC input clock frequency
    *
    * @return Frequency as a uint32_t in Hz
    */
   static uint32_t getSdhcClock() {
      
      switch(sim->SOPT2&SIM_SOPT2_SDHCSRC_MASK) {
      default:
      case SIM_SOPT2_SDHCSRC(0): return SystemCoreClock;
      case SIM_SOPT2_SDHCSRC(1): return getPeripheralClock();
      case SIM_SOPT2_SDHCSRC(2): return Osc0Info::getOscerClock();
      case SIM_SOPT2_SDHCSRC(3): return 0; // TODO SDHC0_CLKIN
      }
   }
   #endif

   #ifdef SIM_SOPT2_FBSL
   /**
    * Set External Bus security level.
    *
    * If flash security is enabled, then this sets what CPU operations can access off-chip via the
    * FlexBus or SDRAMinterface.
    *
    * @param simExternalBusSecurity Security level
    */
   static void setExternalBusSecurity(SimExternalBusSecurity simExternalBusSecurity) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_FBSL_MASK) | simExternalBusSecurity;
   }
   #endif

   #ifdef SIM_SOPT2_TIMESRC_MASK
   /**
    * Get IEEE 1588 Timestamp clock frequency
    *
    * @return Clock frequency as a uint32_t in Hz
    */
   static uint32_t getTimeClock() {
      
      switch(sim->SOPT2&SIM_SOPT2_TIMESRC_MASK) {
      default:
      case SIM_SOPT2_TIMESRC(0): return SystemCoreClock;
      case SIM_SOPT2_TIMESRC(1): return getPeripheralClock();
      case SIM_SOPT2_TIMESRC(2): return Osc0Info::getOscerClock();
      case SIM_SOPT2_TIMESRC(3): return 0; // TODO ENET_1588_CLKIN
      }
   }
   #endif

   #ifdef SIM_SOPT2_FLEXIOSRC
   /**
    * Set FLEXIO input clock source
    *
    * @param simFlexioClockSource Clock source for FLEXIO
    */
   static void setFlexioClock(SimFlexioClockSource simFlexioClockSource) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_FLEXIOSRC_MASK) | simFlexioClockSource;
   }
   
   /**
    * Get FLEXIO input clock frequency
    *
    * @return Frequency as a uint32_t in Hz
    */
   static uint32_t getFlexioClock() {
   
      switch(sim->SOPT2&SIM_SOPT2_FLEXIOSRC_MASK) {
      default:
      case SIM_SOPT2_FLEXIOSRC(0): return SystemCoreClock;
      case SIM_SOPT2_FLEXIOSRC(1): return getDividedPeripheralClock();
      case SIM_SOPT2_FLEXIOSRC(2): return Osc0Info::getOscerClock();
      case SIM_SOPT2_FLEXIOSRC(3): return McgInfo::getMcgIrClock();
      }
   }
   #endif

   //! System Options Register 2
   static constexpr uint32_t sopt2 = 
   #ifdef SIM_SOPT2_TRACECLKSEL
      SIM_SOPT2_TRACECLKSEL(0) |      // Debug trace clock select
   #endif
   #ifdef SIM_SOPT2_TIMESRC
      SIM_SOPT2_TIMESRC(-1) |          // IEEE 1588 timestamp clock source select
   #endif
   #ifdef SIM_SOPT2_RMIISRC
      SIM_SOPT2_RMIISRC(-1) |          // Ethernet RMII clock source select
   #endif
   #ifdef SIM_SOPT2_SDHCSRC
         SIM_SOPT2_SDHCSRC(-1) |       // SDHC clock source select
   #endif
   #ifdef SIM_SOPT2_UART0SRC
      SIM_SOPT2_UART0SRC(-1) |         // UART0 clock source select
   #endif
   #ifdef SIM_SOPT2_LPUARTSRC
         SIM_SOPT2_LPUARTSRC(2) |     // LPUART clock source select
   #endif
   #ifdef SIM_SOPT2_LPUART0SRC
         SIM_SOPT2_LPUART0SRC(-1) |     // LPUART clock source select
   #endif
   #ifdef SIM_SOPT2_PTD7PAD
         SIM_SOPT2_PTD7PAD(-1) |       // PTD7 pad drive strength
   #endif
   #ifdef SIM_SOPT2_TPMSRC
         SIM_SOPT2_TPMSRC(-1) |        // TPM clock source select
   #endif
   #ifdef SIM_SOPT2_EMVSIMSRC
         SIM_SOPT2_EMVSIMSRC(-1) | // EMVSIMSRC clock source select
   #endif
   #ifdef SIM_SOPT2_USBSRC
         SIM_SOPT2_USBSRC(1) |        // USB clock source select
   #endif
   #ifdef SIM_SOPT2_FBSL
         SIM_SOPT2_FBSL(0) |          // FlexBus security level
   #endif
   #ifdef SIM_SOPT2_PLLFLLSEL
         SIM_SOPT2_PLLFLLSEL(1)|      // PLL/FLL clock select
   #endif
   #ifdef SIM_SOPT2_RTCCLKOUTSEL
         SIM_SOPT2_RTCCLKOUTSEL(1) |  // RTC clock out select
   #endif
         SIM_SOPT2_CLKOUTSEL(6);      // CLKOUT pin clock source select

   #if defined(SIM_CLKDIV3_PLLFLLDIV)
   /**
    * Set clock divider for some peripherals (TPM,LPUART,FLEXIO)
    *
    * @param simPeripheralClockDivider Clock divider
    */
   static void setPeripheralClockDivider(SimPeripheralClockDivider simPeripheralClockDivider) {
      // Must disable clock to TPMs, LPUARTs and FLEXIO before changing clock divider
      uint32_t scgc2 = sim->SCGC2;
      sim->SCGC2   = 0;
      sim->CLKDIV3 = simPeripheralClockDivider;
      sim->SCGC2   = scgc2;
   }

   /**
    * Get Peripheral clock frequency after clock divider (TPM,LPUART,FLEXIO)
    *
    * @return Frequency as a uint32_t in Hz
    */
   static uint32_t getDividedPeripheralClock() {
      int  pllfllfrac  = (sim->CLKDIV3&SIM_CLKDIV3_PLLFLLFRAC_MASK)>>SIM_CLKDIV3_PLLFLLFRAC_SHIFT;
      int  pllflldiv   = (sim->CLKDIV3&SIM_CLKDIV3_PLLFLLDIV_MASK)>>SIM_CLKDIV3_PLLFLLDIV_SHIFT;
      return (getPeripheralClock()*(pllfllfrac+1))/(pllflldiv+1);
   }
   #endif

   #if defined(SIM_SOPT2_TPMSRC)
   /**
    * Set TPM input clock source
    *
    * @param simTpmClockSource Clock source for TPM
    */
   static void setTpmClock(SimTpmClockSource simTpmClockSource) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_TPMSRC_MASK) | simTpmClockSource;
   }

   /**
    * Get TPM input clock frequency
    *
    * @return TPM input clock frequency as a uint32_t in Hz
    */
   static uint32_t getTpmClock() {
      
      switch(sim->SOPT2&SIM_SOPT2_TPMSRC_MASK) {
      default:
      case SIM_SOPT2_TPMSRC(0): return 0;
      case SIM_SOPT2_TPMSRC(1): return getDividedPeripheralClock();
      case SIM_SOPT2_TPMSRC(2): return Osc0Info::getOscerClock();
      case SIM_SOPT2_TPMSRC(3): return McgInfo::getMcgIrClock();
      }
   }
   #endif

   #if defined(SIM_SOPT2_EMVSIMSRC)
   /**
    * Set EMVSIMSRC input clock source
    *
    * @param simEmvsimClockSource Clock source for EMVSIMSRC
    */
   static void setEmvsimClock(SimEmvsimClockSource simEmvsimClockSource) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_EMVSIMSRC_MASK) | simEmvsimClockSource;
   }

   /**
    * Get EMVSIMSRC input clock frequency
    *
    * @return EMVSIMSRC input clock frequency as a uint32_t in Hz
    */
   static uint32_t getEmvsimClock() {
      
      switch(sim->SOPT2&SIM_SOPT2_EMVSIMSRC_MASK) {
      default:
      case SIM_SOPT2_EMVSIMSRC(0): return 0;
      case SIM_SOPT2_EMVSIMSRC(1): return getDividedPeripheralClock();
      case SIM_SOPT2_EMVSIMSRC(2): return Osc0Info::getOscerClock();
      case SIM_SOPT2_EMVSIMSRC(3): return McgInfo::getMcgIrClock();
      }
   }
   #endif

   //! System Options Register 4
   static constexpr uint32_t sopt4 = 
   #ifdef SIM_SOPT4_FTM3TRG1SRC
      SIM_SOPT4_FTM3TRG1SRC(1) |   // FlexTimer 3 Hardware Trigger 1 Source Select
   #endif
   #ifdef SIM_SOPT4_FTM3TRG0SRC
      SIM_SOPT4_FTM3TRG0SRC(1) |   // FlexTimer 3 Hardware Trigger 0 Source Select
   #endif
   #ifdef SIM_SOPT4_FTM0TRG1SRC
      SIM_SOPT4_FTM0TRG1SRC(0) |   // FlexTimer 0 Hardware Trigger 1 Source Select
   #endif
   #ifdef SIM_SOPT4_FTM0TRG0SRC
      SIM_SOPT4_FTM0TRG0SRC(0) |   // FlexTimer 0 Hardware Trigger 0 Source Select
   #endif
   #ifdef SIM_SOPT4_FTM3CLKSEL
      SIM_SOPT4_FTM3CLKSEL(0)  |   // FlexTimer 3 External Clock Pin Select
   #endif
   #ifdef SIM_SOPT4_FTM2CLKSEL
      SIM_SOPT4_FTM2CLKSEL(0)  |   // FlexTimer 2 External Clock Pin Select
   #endif
   #ifdef SIM_SOPT4_FTM1CLKSEL
      SIM_SOPT4_FTM1CLKSEL(0)  |   // FlexTimer 1 External Clock Pin Select
   #endif
   #ifdef SIM_SOPT4_FTM0CLKSEL
      SIM_SOPT4_FTM0CLKSEL(0)  |   // FlexTimer 0 External Clock Pin Select
   #endif
   #ifdef SIM_SOPT4_FTM2CH1SRC
      SIM_SOPT4_FTM2CH1SRC(0)  |   // FTM2 channel 1 input capture source select
   #endif
   #ifdef SIM_SOPT4_FTM2CH0SRC
      SIM_SOPT4_FTM2CH0SRC(0)  |   // FTM2 channel 0 input capture source select
   #endif
   #ifdef SIM_SOPT4_FTM1CH0SRC
      SIM_SOPT4_FTM1CH0SRC(0)  |   // FTM1 channel 0 input capture source select
   #endif
   #ifdef SIM_SOPT4_FTM3FLT0
      SIM_SOPT4_FTM3FLT0(0)    |   // FlexTimer 3 Fault 0 Select
   #endif
   #ifdef SIM_SOPT4_FTM2FLT0
      SIM_SOPT4_FTM2FLT0(0)    |   // FlexTimer 2 Fault 0 Select
   #endif
   #ifdef SIM_SOPT4_FTM1FLT0
      SIM_SOPT4_FTM1FLT0(0)    |   // FlexTimer 1 Fault 0 Select
   #endif
   #ifdef SIM_SOPT4_FTM0FLT3
      SIM_SOPT4_FTM0FLT3(-1)    |   // FlexTimer 0 Fault 3 Select
   #endif
   #ifdef SIM_SOPT4_FTM0FLT2
      SIM_SOPT4_FTM0FLT2(-1)    |   // FlexTimer 0 Fault 2 Select
   #endif
      SIM_SOPT4_FTM0FLT1(0)    |   // FlexTimer 0 Fault 1 Select
      SIM_SOPT4_FTM0FLT0(0);       // FlexTimer 0 Fault 0 Select

   #if defined(SIM_SOPT4_FTM3TRG1SRC_MASK)
   /**
    * Select FlexTimer 3 Hardware Trigger 1 Source
    *
    * @param simFtm3Trg1Src Trigger Source
    */
   static void setFtm3Trg1Src(SimFtm3Trg1Src simFtm3Trg1Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM3TRG1SRC_MASK)|simFtm3Trg1Src;   
   };
   #endif

