podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: ADC0_SE0             = ADC0_DP0(p9)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   1: ADC0_SE1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: ADC0_SE2             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: ADC0_SE3             = ADC1_DP0(p11)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   4: ADC0_SE4b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: ADC0_SE5b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: ADC0_SE6b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: ADC0_SE7b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: ADC0_SE8             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: ADC0_SE9             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  11: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  12: ADC0_SE12            = PTB2(p37)                      */  { PortBInfo,  2,            (PcrValue)0x08000UL  },
         /*  13: ADC0_SE13            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: ADC0_SE14            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: ADC0_SE15            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  16: ADC0_SE16            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  17: ADC0_SE17            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  18: ADC0_SE18            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  19: ADC0_SE19            = ADC0_DM0(p10)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  20: ADC0_SE20            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  21: ADC0_SE21            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  22: ADC0_SE22            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  23: ADC0_SE23            = DAC0_OUT(p18)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  24: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  25: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  26: ADC0_SE26            = TEMP_SENSOR(Internal)          */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  27: ADC0_SE27            = BANDGAP(Internal)              */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTB = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTB_CLOCK_MASK);
#endif

PORTB->GPCLR = 0x8000UL|PORT_GPCLR_GPWE(0x0004UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTB = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTB_CLOCK_MASK);
#endif

PORTB->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

#define USBDM_ADC0_INFODP_IS_DEFINED
   class InfoDP {
   public:
      //! Number of signals available in info table
      static constexpr int numSignals  = 4;

      //! Information for each signal of peripheral
      static constexpr PinInfo  info[] = {
   
            //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
            /*   0: ADC0_DP0             = ADC0_DP0(p9)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
            /*   1: ADC0_DP1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
            /*   2: ADC0_DP2             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
            /*   3: ADC0_DP3             = ADC1_DP0(p11)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
      };

      /**
       * Initialise pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void initPCRs() {
      }

      /**
       * Resets pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void clearPCRs() {
      }

   }; 

#define USBDM_ADC0_INFODM_IS_DEFINED
   class InfoDM {
   public:
      //! Number of signals available in info table
      static constexpr int numSignals  = 4;

      //! Information for each signal of peripheral
      static constexpr PinInfo  info[] = {
   
            //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
            /*   0: ADC0_DM0             = ADC0_DM0(p10)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
            /*   1: ADC0_DM1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
            /*   2: ADC0_DM2             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
            /*   3: ADC0_DM3             = ADC1_DM0(p12)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
      };

      /**
       * Initialise pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void initPCRs() {
      }

      /**
       * Resets pins used by peripheral

       * @note Only the lower 16-bits of the PCR registers are affected
       */
      static void clearPCRs() {
      }

