podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK);
#endif

PORTC->GPCLR = 0x8000UL|PORT_GPCLR_GPWE(0x0080UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK);
#endif

PORTC->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

#define USBDM_CMP1_IS_DEFINED
/**
 * Peripheral information for CMP, Analogue Comparator.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Cmp1Info {
public:
   // Template:cmp1_mk22f

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = CMP1_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<CMP_Type> cmp = baseAddress;

   //! Pin number in Info table for comparator output if mapped to a pin
   static constexpr int outputPin  = 8;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! CMP Control Register 0
   static constexpr uint32_t cr0 =
      CMP_CR0_FILTER_CNT(0)     | // Filter Sample Count
      CMP_CR0_HYSTCTR(0);         // Comparator hard block hysteresis control

   #ifndef CMP_CR1_TRIGM
   #define CMP_CR1_TRIGM(x) 0
   #endif

   //! CMP Control Register 1
   static constexpr uint32_t cr1 =
      CMP_CR1_SE(0)    | // Sample Enable
      CMP_CR1_WE(0)    | // Windowing Enable
      CMP_CR1_TRIGM(0) | // Trigger Mode Enable
      CMP_CR1_PMODE(0) | // Power mode Select
      CMP_CR1_INV(0)   | // Comparator Invert
      CMP_CR1_COS(0)   | // Comparator Output Select
      CMP_CR1_OPE(0);    // Comparator Output Pin Enable

   //! CMP Filter Period Register
   static constexpr uint32_t fpr =
      CMP_FPR_FILT_PER(0); // Filter Sample Period

   //! CMP Status and Control Register
   static constexpr uint32_t scr =
   #ifdef CMP_SCR_DMAEN
      CMP_SCR_DMAEN(0) | // DMA Enable Control
   #endif
      CMP_SCR_IER(0) | // Comparator Interrupt Enable Rising
      CMP_SCR_IEF(0);  // Comparator Interrupt Enable Falling

   //! DAC Control Register
   static constexpr uint32_t daccr =
      CMP_DACCR_VRSEL(0); // Supply Voltage Reference Source Select

   //! MUX Control Register
   static constexpr uint32_t muxcr =
      CMP_MUXCR_PSEL(0)| // Plus Input Mux Control
      CMP_MUXCR_MSEL(0); // Minus Input Mux Control

   /** 
    *  Enable clock to Cmp1
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableCmp1Clock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_CMP_MASK;
#endif
   }

   /** 
    *  Disable clock to Cmp1
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableCmp1Clock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_CMP_MASK;
#endif
   }

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = CMP1_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   //! Number of signals available in info table
   static constexpr int numSignals  = 9;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: CMP1_IN0             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: CMP1_IN1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: CMP1_IN2             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: CMP1_IN3             = DAC0_OUT(p18)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   4: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*   5: CMP1_IN5             = VREF_OUT(p17)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   6: CMP1_IN6             = BANDGAP(Internal)              */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   7: CMP1_IN7             = CMP_DAC(Internal)              */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   8: CMP1_OUT             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group CMP_Group
 * @}
 */
/**
 * @addtogroup Control_Group CONTROL, Control
 * @brief Abstraction for Control
 * @{
 */
#define USBDM_CONTROL_IS_DEFINED
/**
 * Peripheral information for CONTROL, Control.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class ControlInfo {
public:
   // Template:control

   //! Number of signals available in info table
   static constexpr int numSignals  = 12;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: RESET_b              = RESET_b(p34)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   1: JTAG_TCLK            = PTA0(p22)                      */  { PortAInfo,  0,            (PcrValue)0x08700UL  },
         /*   2: SWD_CLK              = PTA0(p22)                      */  { PortAInfo,  0,            (PcrValue)0x08700UL  },
         /*   3: JTAG_TDI             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: JTAG_TDO             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: TRACE_SWO            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: JTAG_TMS             = PTA3(p25)                      */  { PortAInfo,  3,            (PcrValue)0x08700UL  },
         /*   7: SWD_DIO              = PTA3(p25)                      */  { PortAInfo,  3,            (PcrValue)0x08700UL  },
         /*   8: NMI_b                = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: JTAG_TRST_b          = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: CLKOUT               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: CLKOUT32K            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

