podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTA = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTA_CLOCK_MASK);
#endif

PORTA->GPCLR = 0x8700UL|PORT_GPCLR_GPWE(0x0009UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTA = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTA_CLOCK_MASK);
#endif

PORTA->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

/** 
 * End group Control_Group
 * @}
 */
/**
 * @addtogroup CRC_Group CRC, Cyclic Redundancy Check
 * @brief Abstraction for Cyclic Redundancy Check
 * @{
 */
#define USBDM_CRC0_IS_DEFINED
/**
 * Peripheral information for CRC, Cyclic Redundancy Check.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Crc0Info {
public:
   // Template:crc0_0x40032000

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = CRC0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<CRC_Type> crc = baseAddress;

   static constexpr uint32_t gpoly =  0;

   /** 
    *  Enable clock to Crc0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableCrc0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_CRC_MASK;
#endif
   }

   /** 
    *  Disable clock to Crc0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableCrc0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_CRC_MASK;
#endif
   }

};

/** 
 * End group CRC_Group
 * @}
 */
/**
 * @addtogroup CONSOLE_Group Console, Console Interface
 * @brief Abstraction for Console Interface
 * @{
 */
/** 
 * End group CONSOLE_Group
 * @}
 */
/**
 * @addtogroup DAC_Group DAC, Digital-to-Analogue Converter
 * @brief Abstraction for Digital-to-Analogue Converter
 * @{
 */
#define USBDM_DAC0_IS_DEFINED
/**
 * Peripheral information for DAC, Digital-to-Analogue Converter.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Dac0Info {
public:
   // Template:dac0_16ch_fifo16

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = DAC0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<DAC_Type> dac = baseAddress;

   //! Pin number in Info table for DAC output if mapped to a pin
   static constexpr int outputPin  = 0;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! DAC Control Register 0
   static constexpr uint32_t c0 =
      DAC_C0_DACRFS(1)        | // Reference Select
      DAC_C0_DACTRGSEL(1)     | // Trigger Select
      DAC_C0_LPEN(0)          | // Low Power Control
   #if defined(DAC_C0_DACBWIEN)
      DAC_C0_DACBWIEN(0)      | // Buffer Watermark Interrupt Enable
   #endif
      DAC_C0_DACBTIEN(0)      | // Buffer Read Pointer Top Flag Interrupt Enable
      DAC_C0_DACBBIEN(0);       // Buffer Read Pointer Bottom Flag Interrupt Enable

   //! DAC Control Register 1
   static constexpr uint32_t c1 =
      DAC_C1_DMAEN(0)       | // DMA Enable Select
      DAC_C1_DACBFWM(0)     | // Buffer Watermark Select
      DAC_C1_DACBFMD(0)     | // Buffer Work Mode Select
      DAC_C1_DACBFEN(0);      // Buffer Enable

   //! DAC Control Register 2
   static constexpr uint32_t c2 =
      DAC_C2_DACBFUP(1);   // DAC Buffer Upper Limit

   /** 
    *  Enable clock to Dac0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableDac0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_DAC0_MASK;
#endif
   }

   /** 
    *  Disable clock to Dac0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableDac0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_DAC0_MASK;
#endif
   }

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = DAC0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   //! Number of signals available in info table
   static constexpr int numSignals  = 1;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: DAC0_OUT             = DAC0_OUT(p18)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

#define USBDM_DAC1_IS_DEFINED
/**
 * Peripheral information for DAC, Digital-to-Analogue Converter.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Dac1Info {
public:
   // Template:dac0_16ch_fifo16

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = DAC1_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<DAC_Type> dac = baseAddress;

   //! Pin number in Info table for DAC output if mapped to a pin
   static constexpr int outputPin  = 0;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! DAC Control Register 0
   static constexpr uint32_t c0 =
      DAC_C0_DACRFS(1)        | // Reference Select
      DAC_C0_DACTRGSEL(1)     | // Trigger Select
      DAC_C0_LPEN(0)          | // Low Power Control
   #if defined(DAC_C0_DACBWIEN)
      DAC_C0_DACBWIEN(0)      | // Buffer Watermark Interrupt Enable
   #endif
      DAC_C0_DACBTIEN(0)      | // Buffer Read Pointer Top Flag Interrupt Enable
      DAC_C0_DACBBIEN(0);       // Buffer Read Pointer Bottom Flag Interrupt Enable

   //! DAC Control Register 1
   static constexpr uint32_t c1 =
      DAC_C1_DMAEN(0)       | // DMA Enable Select
      DAC_C1_DACBFWM(0)     | // Buffer Watermark Select
      DAC_C1_DACBFMD(0)     | // Buffer Work Mode Select
      DAC_C1_DACBFEN(0);      // Buffer Enable

   //! DAC Control Register 2
   static constexpr uint32_t c2 =
      DAC_C2_DACBFUP(1);   // DAC Buffer Upper Limit

   /** 
    *  Enable clock to Dac1
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableDac1Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_DAC1_MASK;
#endif
   }

   /** 
    *  Disable clock to Dac1
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableDac1Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_DAC1_MASK;
#endif
   }

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = DAC1_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

