podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   //! Number of signals available in info table
   static constexpr int numSignals  = 1;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: DAC1_OUT             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group DAC_Group
 * @}
 */
/**
 * @addtogroup DMA_Group DMA, Direct Memory Access (DMA)
 * @brief Abstraction for Direct Memory Access (DMA)
 * @{
 */
#define USBDM_DMA0_IS_DEFINED
/**
 * Peripheral information for DMA, Direct Memory Access (DMA).
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Dma0Info {
public:
   // Template:dma0_16ch_ears16

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = DMA0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<DMA_Type> dma = baseAddress;

   /** 
    *  Enable clock to Dma0
    */
   static void enableClock() {
#ifdef PCC
      // DMA is always clocked
#else
      SIM->SCGC7 = SIM->SCGC7 | SIM_SCGC7_DMA_MASK;
#endif
   }

   /** 
    *  Disable clock to Dma0
    */
   static void disableClock() {
#ifdef PCC
      // DMA is always clocked
#else
      SIM->SCGC7 = SIM->SCGC7 & ~SIM_SCGC7_DMA_MASK;
#endif
   }

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = DMA0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   //! Number of DMA channels implemented
   static constexpr unsigned NumChannels = 16;

   //! Number of DMA vectors implemented
   static constexpr unsigned NumVectors = 16;

};

/** 
 * End group DMA_Group
 * @}
 */
/**
 * @addtogroup DMAMUX_Group DMAMUX, Direct Memory Access (DMA)
 * @brief Abstraction for Direct Memory Access (DMA)
 * @{
 */
#define USBDM_DMAMUX0_IS_DEFINED
/**
 * Peripheral information for DMAMUX, Direct Memory Access (DMA).
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Dmamux0Info {
public:
   // Template:dmamux0_16ch_trig_mk22f51212

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = DMAMUX0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<DMAMUX_Type> dmamux = baseAddress;

   /** 
    *  Enable clock to Dmamux0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableDmamux0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_DMAMUX0_MASK;
#endif
   }

   /** 
    *  Disable clock to Dmamux0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableDmamux0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_DMAMUX0_MASK;
#endif
   }

   // Number of DMA channels implemented
   static constexpr unsigned NumChannels = 16;

   static constexpr uint8_t chcfg0_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg1_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg2_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg3_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg4_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg5_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg6_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg7_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg8_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg9_source  = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg10_source = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg11_source = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg12_source = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg13_source = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg14_source = DMAMUX_CHCFG_SOURCE(0);
   static constexpr uint8_t chcfg15_source = DMAMUX_CHCFG_SOURCE(0);
};

/** 
 * End group DMAMUX_Group
 * @}
 */
/**
 * @addtogroup EWM_Group EWM, External Watchdog Monitor
 * @brief Abstraction for External Watchdog Monitor
 * @{
 */
#define USBDM_EWM_IS_DEFINED
/**
 * Peripheral information for EWM, External Watchdog Monitor.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class EwmInfo {
public:
   // Template:ewm_int_pr

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = EWM_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<EWM_Type> ewm = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! Pin number in Info table for EWM input if mapped to a pin
   static constexpr int inputPin  = 0;

   //! Pin number in Info table for EWM output if mapped to a pin
   static constexpr int outputPin  = 1;

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = EWM_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

