podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Ewm
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableEwmClock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_EWM_MASK;
#endif
   }

   /** 
    *  Disable clock to Ewm
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableEwmClock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_EWM_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 2;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: EWM_IN               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: EWM_OUT_b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group EWM_Group
 * @}
 */
/**
 * @addtogroup FLEXBUS_Group FLEXBUS, Flexbus - External Bus Interface
 * @brief Abstraction for Flexbus - External Bus Interface
 * @{
 */
#define USBDM_FLEXBUS_IS_DEFINED
/**
 * Peripheral information for FLEXBUS, Flexbus - External Bus Interface.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
   /**
    * FlexBus Signal Group 1 Multiplex control.
    * Controls the multiplexing of the FB_ALE, FB_CS1 , and FB_TS signals.
    */
   enum FlexbusGroup1 {
      FlexbusGroup1_FB_ALE       = FLEXBUS_CSPMCR_GROUP1(0b0000), /**< FB_ALE */
      FlexbusGroup1_FB_CS1       = FLEXBUS_CSPMCR_GROUP1(0b0001), /**< FB_CS1 */
      FlexbusGroup1_FB_TS        = FLEXBUS_CSPMCR_GROUP1(0b0010), /**< FB_TS */
   };
   /**
    * FlexBus Signal Group 2 Multiplex control.
    * Controls the multiplexing of the FB_CS4 , FB_TSIZ0, and FB_BE_31_24 signals.
    */
   enum FlexbusGroup2 {
      FlexbusGroup2_FB_CS4       = FLEXBUS_CSPMCR_GROUP2(0b0000), /**< FB_CS4 */
      FlexbusGroup2_FB_TSIZ0     = FLEXBUS_CSPMCR_GROUP2(0b0001), /**< FB_TSIZ0 */
      FlexbusGroup2_FB_BE_31_24  = FLEXBUS_CSPMCR_GROUP2(0b0010), /**< FB_BE_31_24 */
   };
   /**
    * FlexBus Signal Group 3 Multiplex control.
    * Controls the multiplexing of the FB_CS5 , FB_TSIZ1, and FB_BE_23_16 signals.
    */
   enum FlexbusGroup3 {
      FlexbusGroup3_FB_CS5       = FLEXBUS_CSPMCR_GROUP3(0b0000), /**< FB_CS5 */
      FlexbusGroup3_FB_TSIZ1     = FLEXBUS_CSPMCR_GROUP3(0b0001), /**< FB_TSIZ1 */
      FlexbusGroup3_FB_BE_23_16  = FLEXBUS_CSPMCR_GROUP3(0b0010), /**< FB_BE_23_16 */
   };
   /**
    * FlexBus Signal Group 4 Multiplex control.
    * Controls the multiplexing of the FB_TBST , FB_CS2 , and FB_BE_15_8 signals.
    */
   enum FlexbusGroup4 {
      FlexbusGroup4_FB_TBST      = FLEXBUS_CSPMCR_GROUP4(0b0000), /**< FB_TBST */
      FlexbusGroup4_FB_CS2       = FLEXBUS_CSPMCR_GROUP4(0b0001), /**< FB_CS2 */
      FlexbusGroup4_FB_BE_15_8   = FLEXBUS_CSPMCR_GROUP4(0b0010), /**< FB_BE_15_8 */
   };
   /**
    * FlexBus Signal Group 5 Multiplex control.
    * Controls the multiplexing of the FB_TA , FB_CS3 , and FB_BE_7_0 signals.
    */
   enum FlexbusGroup5 {
      FlexbusGroup5_FB_TA        = FLEXBUS_CSPMCR_GROUP5(0b0000), /**< FB_TA */
      FlexbusGroup5_FB_CS3       = FLEXBUS_CSPMCR_GROUP5(0b0001), /**< FB_CS3 - You must also write 1b to CSCR[AA].*/
      FlexbusGroup5_FB_BE_7_0    = FLEXBUS_CSPMCR_GROUP5(0b0010), /**< FB_BE_7_0 - You must also write 1b to CSCR[AA].*/
   };

class FlexbusInfo {
public:
   // Template:flexbus

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = true;

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = FLEXBUS_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<FLEXBUS_Type> flexbus = baseAddress;

   /** 
    *  Enable clock to Flexbus
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableFlexbusClock();
#else
      SIM->SCGC7 = SIM->SCGC7 | SIM_SCGC7_FLEXBUS_MASK;
#endif
   }

   /** 
    *  Disable clock to Flexbus
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableFlexbusClock();
#else
      SIM->SCGC7 = SIM->SCGC7 & ~SIM_SCGC7_FLEXBUS_MASK;
#endif
   }

   /**
    * Configure the multiplexing of <b>shared</b> FlexBus/Sdramc signals.
    *
    * Shared pins are configures as follows:
    * - Group2 = FB_BE_31_24 signals.
    * - Group3 = FB_BE_23_16 signals.
    * - Group4 = FB_BE_15_8 signals.
    * - Group5 = FB_BE_7_0 signals.
    *
    * @note Group1 settings are unchanged as they are not shared.
    * @note The clock to the Flexbus controller will be enabled.
    */
   static void configureSharedMultiplexing() {
      enableClock();
      CriticalSection cs;
      flexbus->CSPMCR =
         (flexbus->CSPMCR&~(FLEXBUS_CSPMCR_GROUP2_MASK|FLEXBUS_CSPMCR_GROUP3_MASK|FLEXBUS_CSPMCR_GROUP4_MASK|FLEXBUS_CSPMCR_GROUP5_MASK))|
         (FlexbusGroup2_FB_BE_31_24|FlexbusGroup3_FB_BE_23_16|FlexbusGroup4_FB_BE_15_8|FlexbusGroup5_FB_BE_7_0);
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 83;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: FB_CS0_b             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: FB_CS1_b             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: FB_CS2_b             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: FB_CS3_b             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: FB_CS4_b             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: FB_CS5_b             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: FB_AD0               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: FB_AD1               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: FB_AD2               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: FB_AD3               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: FB_AD4               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: FB_AD5               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: FB_AD6               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  13: FB_AD7               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: FB_AD8               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: FB_AD9               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  16: FB_AD10              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  17: FB_AD11              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  18: FB_AD12              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  19: FB_AD13              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  20: FB_AD14              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  21: FB_AD15              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  22: FB_AD16              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  23: FB_AD17              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  24: FB_AD18              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  25: FB_AD19              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  26: FB_AD20              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  27: FB_AD21              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  28: FB_AD22              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  29: FB_AD23              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  30: FB_AD24              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  31: FB_AD25              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  32: FB_AD26              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  33: FB_AD27              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  34: FB_AD28              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  35: FB_AD29              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  36: FB_AD30              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  37: FB_AD31              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  38: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  39: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  40: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  41: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  42: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  43: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  44: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  45: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  46: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  47: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  48: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  49: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  50: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  51: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  52: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  53: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  54: FB_A16               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  55: FB_A17               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  56: FB_A18               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  57: FB_A19               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  58: FB_A20               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  59: FB_A21               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  60: FB_A22               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  61: FB_A23               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  62: FB_A24               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  63: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  64: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  65: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  66: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  67: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  68: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  69: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  70: CLKOUT               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  71: FB_TSIZ0             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  72: FB_TSIZ1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  73: FB_ALE               = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  74: FB_OE_b              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  75: FB_RW_b              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  76: FB_TA_b              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  77: FB_TBST_b            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  78: FB_TS_b              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  79: FB_BE7_0_BLS31_24_b  = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  80: FB_BE15_8_BLS23_16_b = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  81: FB_BE23_16_BLS15_8_b = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  82: FB_BE31_24_BLS7_0_b  = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

