podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
};

/** 
 * End group FLEXBUS_Group
 * @}
 */
/**
 * @addtogroup FTFA_Group FTFA, Flash Memory Module
 * @brief Abstraction for Flash Memory Module
 * @{
 */
#define USBDM_FTFA_IS_DEFINED
/**
 * Peripheral information for FTFA, Flash Memory Module.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class FtfaInfo {
public:
   // Template:ftfa_xacch

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = FTFA_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<FTFA_Type> ftfa = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = FTFA_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Ftfa
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableFtfaClock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_FTF_MASK;
#endif
   }

   /** 
    *  Disable clock to Ftfa
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableFtfaClock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_FTF_MASK;
#endif
   }

};

/** 
 * End group FTFA_Group
 * @}
 */
/**
 * @addtogroup FTM_Group FTM, PWM, Input capture and Output compare
 * @brief Abstraction for PWM, Input capture and Output compare
 * @{
 */
#define USBDM_FTM_IS_DEFINED
/**
 * Peripheral information for FTM, PWM, Input capture and Output compare.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class FtmInfo {
public:
   // Template:ftm

   //! Number of signals available in info table
   static constexpr int numSignals  = 2;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: FTM_CLKIN0           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: FTM_CLKIN1           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

#define USBDM_FTM0_IS_DEFINED
/**
 * Peripheral information for FTM, PWM, Input capture and Output compare.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Ftm0Info {
public:
   // Template:ftm0_8ch_icrst

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! Number of channels implemented
   static constexpr unsigned NumChannels = 8;

   //! Number of channel event vectors implemented
   static constexpr unsigned NumChannelVectors = 1;

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = FTM0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<FTM_Type> ftm = baseAddress;

   //! Timer external input frequency
   static constexpr uint32_t ftmExternalClock =  0;

   //! Default Timer Modulo
   static constexpr uint32_t modulo = FTM_MOD_MOD(10000);

   //! Default value for SC register
   static constexpr uint32_t sc  = 
       FTM_SC_CPWMS(0)| // Centre-Aligned PWM Select
       FTM_SC_CLKS(1)|  // Clock Mode Selection
       FTM_SC_TOIE(0)|  // Timer Overflow Interrupt Enable
       FTM_SC_PS(0);    // Prescale Factor Selection 

   //! Default value for EXTTRIG) register
   static constexpr uint32_t exttrig  = 
       0x0|                              // External Trigger Enable
       FTM_EXTTRIG_INITTRIGEN(0);    // Initialisation Trigger Enable 

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = FTM0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** Minimum resolution for PWM interval */
   static constexpr uint32_t minimumResolution=100;

   /** Minimum usable interval in ticks */      
   static constexpr uint32_t minimumInterval=20;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getInputClockFrequency() {
   
      switch(ftm->SC&FTM_SC_CLKS_MASK) {
      default:
      case FTM_SC_CLKS(0): return 0;
      case FTM_SC_CLKS(1): return SystemBusClock;
      case FTM_SC_CLKS(2): return SystemMcgffClock;
      case FTM_SC_CLKS(3): return ftmExternalClock;
      }
   }

   /** 
    *  Enable clock to Ftm0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableFtm0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_FTM0_MASK;
#endif
   }

   /** 
    *  Disable clock to Ftm0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableFtm0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_FTM0_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 10;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: FTM0_CH0             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: FTM0_CH1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: FTM0_CH2             = PTC3(p46)                      */  { PortCInfo,  3,            (PcrValue)0x00400UL  },
         /*   3: FTM0_CH3             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: FTM0_CH4             = PTD4(p61)                      */  { PortDInfo,  4,            (PcrValue)0x00400UL  },
         /*   5: FTM0_CH5             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: FTM0_CH6             = PTD6(p63)                      */  { PortDInfo,  6,            (PcrValue)0x00400UL  },
         /*   7: FTM0_CH7             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: FTM_CLKIN0           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: FTM_CLKIN1           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

