podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: LLWU_P0              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: LLWU_P1              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: LLWU_P2              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: LLWU_P3              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: LLWU_P4              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: LLWU_P5              = PTB0(p35)                      */  { PortBInfo,  0,            (PcrValue)0x08100UL  },
         /*   6: LLWU_P6              = PTC1(p44)                      */  { PortCInfo,  1,            (PcrValue)0x08100UL  },
         /*   7: LLWU_P7              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: LLWU_P8              = PTC4(p49)                      */  { PortCInfo,  4,            (PcrValue)0x08100UL  },
         /*   9: LLWU_P9              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: LLWU_P10             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: LLWU_P11             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: LLWU_P12             = PTD0(p57)                      */  { PortDInfo,  0,            (PcrValue)0x08100UL  },
         /*  13: LLWU_P13             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: LLWU_P14             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: LLWU_P15             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTB = PCC_PCCn_CGC_MASK;
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
PCC->PCC_PORTD = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTB_CLOCK_MASK|PORTC_CLOCK_MASK|PORTD_CLOCK_MASK);
#endif

PORTB->GPCLR = 0x8100UL|PORT_GPCLR_GPWE(0x0001UL);
PORTC->GPCLR = 0x8100UL|PORT_GPCLR_GPWE(0x0012UL);
PORTD->GPCLR = 0x8100UL|PORT_GPCLR_GPWE(0x0001UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTB = PCC_PCCn_CGC_MASK;
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
PCC->PCC_PORTD = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTB_CLOCK_MASK|PORTC_CLOCK_MASK|PORTD_CLOCK_MASK);
#endif

PORTB->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
PORTC->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
PORTD->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

/** 
 * End group LLWU_Group
 * @}
 */
/**
 * @addtogroup LPTMR_Group LPTMR, Low Power Timer
 * @brief Abstraction for Low Power Timer
 * @{
 */
#define USBDM_LPTMR0_IS_DEFINED
/**
 * Peripheral information for LPTMR, Low Power Timer.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Lptmr0Info {
public:
   // Template:lptmr0

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = LPTMR0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<LPTMR_Type> lptmr = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   //! Minimum resolution for time interval setting
   static constexpr uint32_t minimumResolution = 100;

   //! Default Timer Compare value
   static constexpr uint32_t cmr = 0;

   //! Default PSR value
   static constexpr uint32_t psr = 
      LPTMR_PSR_PRESCALE(0)|
      LPTMR_PSR_PBYP(0)|
      LPTMR_PSR_PCS(0);

   //! Default CSR value
   static constexpr uint32_t csr = 
      LPTMR_CSR_TIE(0)|
      LPTMR_CSR_TMS(0)|
      LPTMR_CSR_TFC(0)|
      LPTMR_CSR_TPP(0)|
      LPTMR_CSR_TPS(0);

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = LPTMR0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as an uint32_t in Hz
    */
   static uint32_t getInputClockFrequency() {
   
      switch(lptmr->PSR&LPTMR_PSR_PCS_MASK) {
      default:
      case LPTMR_PSR_PCS(0): return McgInfo::getMcgIrClock();
      case LPTMR_PSR_PCS(1): return PmcInfo::getLpoClock();
      case LPTMR_PSR_PCS(2): return SimInfo::getErc32kClock();
      case LPTMR_PSR_PCS(3): return Osc0Info::getOscerClock();
      }
   }

   /**
    * Get clock frequency
    *
    * @return Frequency as a float in Hz
    */
   static float getClockFrequencyF() {
   
      float freq = getInputClockFrequency();
      if (lptmr->PSR&LPTMR_PSR_PBYP_MASK) {
         return freq;
      }
      return freq/(1<<(((lptmr->PSR&LPTMR_PSR_PRESCALE_MASK)>>LPTMR_PSR_PRESCALE_SHIFT)+1));
   }

   /**
    * Get clock frequency
    *
    * @return Frequency as a uint32_t in Hz (may underflow)
    */
   static uint32_t getClockFrequency() {
   
      uint32_t freq = getInputClockFrequency();
      if (lptmr->PSR&LPTMR_PSR_PBYP_MASK) {
         return freq;
      }
      return freq/(1<<(((lptmr->PSR&LPTMR_PSR_PRESCALE_MASK)>>LPTMR_PSR_PRESCALE_SHIFT)+1));
   }

   /** 
    *  Enable clock to Lptmr0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableLptmr0Clock();
#else
      SIM->SCGC5 = SIM->SCGC5 | SIM_SCGC5_LPTMR_MASK;
#endif
   }

   /** 
    *  Disable clock to Lptmr0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableLptmr0Clock();
#else
      SIM->SCGC5 = SIM->SCGC5 & ~SIM_SCGC5_LPTMR_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 3;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

