podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*   1: LPTMR0_ALT1          = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: LPTMR0_ALT2          = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group LPTMR_Group
 * @}
 */
/**
 * @addtogroup LPUART_Group LPUART, Low Power Universal Asynchronous Receiver/Transmitter
 * @brief Abstraction for Low Power Universal Asynchronous Receiver/Transmitter
 * @{
 */
#define USBDM_LPUART0_IS_DEFINED
/**
 * Peripheral information for LPUART, Low Power Universal Asynchronous Receiver/Transmitter.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Lpuart0Info {
public:
   // Template:lpuart0_modir_0x4002a000

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = LPUART0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<LPUART_Type> lpuart = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = true;

   //! Number of samples per bit
   static constexpr uint32_t oversampleRatio = 8;

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = LPUART0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Lpuart0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableLpuart0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_LPUART0_MASK;
#endif
   }

   /** 
    *  Disable clock to Lpuart0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableLpuart0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_LPUART0_MASK;
#endif
   }

   //! Default Baud rate used if not explicitly given
   static constexpr uint32_t defaultBaudRate = 115200;

   //! Default buffer size for receive queue when interrupt driven
   static constexpr unsigned receiveBufferSize = 50;

   //! Default buffer size for transmit queue when interrupt driven
   static constexpr unsigned transmitBufferSize = 50;

#if defined(PCC_PCC_LPUART0_CGC_MASK)
   //! Default clock source
   static constexpr PccDiv2Clock defaultClockSource = PccDiv2Clock_Firc;

   /**
    * Set LPUART0 input clock source.
    *
    * @param pccDiv2Clock Clock source selection
    *
    * @note This peripheral uses the DIV2 peripheral clocks e.g. SOSCDIV2_CLK 
    * @note The peripheral bus clock will be disabled before changing the 
            clock and is left disabled.
    */
   static void setClockSource(PccDiv2Clock pccDiv2Clock) {
      PccInfo::setLpuart0ClockSource(pccDiv2Clock);
   }
#endif

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getClockFrequency() {
#if defined(PCC_PCC_LPUART0_CGC_MASK)
      return PccInfo::getLpuart0Frequency();
   #elif defined(SIM_SOPT2_LPUART0SRC_MASK)
      return SimInfo::getLpuart0Clock();
   #else
      return SimInfo::getLpuartClock();
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 4;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: LPUART0_TX           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: LPUART0_RX           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: LPUART0_RTS_b        = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: LPUART0_CTS_b        = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group LPUART_Group
 * @}
 */
/**
 * @addtogroup MCM_Group MCM, Miscellaneous Control Module
 * @brief Abstraction for Miscellaneous Control Module
 * @{
 */
#define USBDM_MCM_IS_DEFINED
/**
 * Peripheral information for MCM, Miscellaneous Control Module.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class McmInfo {
public:
   // Template:mcm_mk22f51212

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = MCM_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<MCM_Type> mcm = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = MCM_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

