podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

};

/** 
 * End group MCM_Group
 * @}
 */
/**
 * @addtogroup PDB_Group PDB, Programmable Delay Block
 * @brief Abstraction for Programmable Delay Block
 * @{
 */
#define USBDM_PDB0_IS_DEFINED
/**
 * Peripheral information for PDB, Programmable Delay Block.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Pdb0Info {
public:
   // Template:pdb0_2ch_2pt_2dac_2po

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = PDB0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<PDB_Type> pdb = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   static constexpr uint32_t pdb_sc = 
      PDB_SC_MULT(0) |      // Multiplication Factor Select for Prescaler
      PDB_SC_PDBIE(0) |     // Interrupt Enable
      PDB_SC_TRGSEL(0) |    // Trigger Input Source Select
      PDB_SC_PRESCALER(0) | // Prescaler Divider Select
      PDB_SC_DMAEN(0) |     // DMA Enable
      PDB_SC_PDBEIE(0) |    // Sequence Error Interrupt Enable
      PDB_SC_LDMOD(0);      // Load Mode Select

   static constexpr uint32_t pdb_mod = 
      PDB_MOD_MOD(65535);  // PDB Modulus

   static constexpr uint32_t pdb_idly = 
      PDB_IDLY_IDLY(0);  // Counter Modulus

   struct PdbChannel {
      uint32_t c1;
      uint32_t dly0;
      uint32_t dly1;
   };

   // Number of PDB channels
   static constexpr size_t numChannels = 2;

   // Default values for channel registers
   static constexpr PdbChannel pdb_ch[numChannels] = {
   {                   // Channel[0] Control Register 1
      PDB_C1_BB(0x0) |   // Pre-Trigger Back-to-Back Operation Enable
      PDB_C1_TOS(0x0) |  // Pre-Trigger Output Select
      PDB_C1_EN(0x0),    // Pre-Trigger Enable
      PDB_DLY_DLY(0),  // Channel[0] pre-trigger delay 0
      PDB_DLY_DLY(0),  // Channel[0] pre-trigger delay 1
   },
   {                   // Channel[1] Control Register 1
      PDB_C1_BB(0x0) |   // Channel Pre-Trigger Back-to-Back Operation Enable
      PDB_C1_TOS(0x0) |  // Channel Pre-Trigger Output Select
      PDB_C1_EN(0x0),    // Channel Pre-Trigger Enable
      PDB_DLY_DLY(0),  // Channel[1] pre-trigger delay 0
      PDB_DLY_DLY(0),  // Channel[1] pre-trigger delay 1
   },
   };

   struct PdbDac {
      uint32_t dacintc;
      uint32_t dacint;
   };

   // Number of DACs
   static constexpr size_t numDacs = 2;

   // Default values for DAC registers
   static constexpr PdbDac pdb_dac[numDacs] = {
   {                    // DAC[0] Interval register
      PDB_INTC_EXT(0) | // DAC External Trigger Input Enable
      PDB_INTC_TOE(0),  // DAC Interval Trigger Enable
      PDB_INT_INT(0),   // DAC Interval
   },
   {                    // DAC[1] Interval register
      PDB_INTC_EXT(0) | // DAC External Trigger Input Enable
      PDB_INTC_TOE(0),  // DAC Interval Trigger Enable
      PDB_INT_INT(0),   // DAC Interval
   },
   };

   static constexpr uint32_t pdb_poen = 
      PDB_POEN_POEN(0x0);   // Pulse-Out Enable

   // Number of PDB pulse outputs
   static constexpr size_t numPulseOutputs = 2;

   static constexpr uint32_t pdb_podly[numPulseOutputs] = {
      // Pulse Output[0] Delays {
      PDB_PODLY_DLY1(0) |  // Delay 1
      PDB_PODLY_DLY2(0),   // Delay 2

      // Pulse Output[1] Delays
      PDB_PODLY_DLY1(0) |  // Delay 1
      PDB_PODLY_DLY2(0),   // Delay 2
   }; 

   /**
     * Get PDB clock frequency
     *
     * @return Frequency as a uint32_t in Hz
     */
   static __attribute__((always_inline)) uint32_t getInputClockFrequency() {
      return SystemBusClock;
   }

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = PDB0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Pdb0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enablePdb0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_PDB_MASK;
#endif
   }

   /** 
    *  Disable clock to Pdb0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disablePdb0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_PDB_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 1;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: PDB0_EXTRG           = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group PDB_Group
 * @}
 */
/**
 * @addtogroup PIT_Group PIT, Programmable Interrupt Timer
 * @brief Abstraction for Programmable Interrupt Timer
 * @{
 */
#define USBDM_PIT_IS_DEFINED
/**
 * Peripheral information for PIT, Programmable Interrupt Timer.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class PitInfo {
public:
   // Template:pit_4ch_chain

   //! Number of PIT channels
   static constexpr uint32_t NumChannels  = 4;

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = PIT_BasePtr;

