podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
PCC->PCC_PORTD = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK|PORTD_CLOCK_MASK);
#endif

PORTC->GPCLR = 0x0200UL|PORT_GPCLR_GPWE(0x0064UL);
PORTD->GPCLR = 0x0200UL|PORT_GPCLR_GPWE(0x0008UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
PCC->PCC_PORTD = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK|PORTD_CLOCK_MASK);
#endif

PORTC->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
PORTD->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

#define USBDM_SPI1_IS_DEFINED
/**
 * Peripheral information for SPI, Serial Peripheral Interface.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Spi1Info {
public:
   // Template:spi1_mk_fifo_depth1

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = SPI1_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<SPI_Type> spi = baseAddress;

   //! Pin number in Info table for SCK if mapped to a pin
   static constexpr int sckPin  = 0;

   //! Pin number in Info table for SIN if mapped to a pin
   static constexpr int sinPin  = 1;

   //! Pin number in Info table for SOUT if mapped to a pin
   static constexpr int soutPin  = 2;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = true;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = SPI1_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Spi1
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableSpi1Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_SPI1_MASK;
#endif
   }

   /** 
    *  Disable clock to Spi1
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableSpi1Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_SPI1_MASK;
#endif
   }

   //! Default communication clock phase and clock polarity (CPHA+CPOL)
   static constexpr uint32_t mode = 
      SPI_CTAR_MODE(1);

   //! Default communication order (MSB/LSB first)
   static constexpr uint32_t lsbfe = 
      SPI_CTAR_LSBFE(0);

   static uint32_t getClockFrequency() {
      return SystemBusClock;
   }

   //! Default speed (Hz)
   static constexpr uint32_t speed = 
      100000;

   //! Number of signals available in info table
   static constexpr int numSignals  = 7;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: SPI1_SCK             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: SPI1_SIN             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: SPI1_SOUT            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: SPI1_PCS0            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: SPI1_PCS1            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: SPI1_PCS2            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: SPI1_PCS3            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group SPI_Group
 * @}
 */
/**
 * @addtogroup UART_Group UART, Universal Asynchronous Receiver/Transmitter
 * @brief Abstraction for Universal Asynchronous Receiver/Transmitter
 * @{
 */
#define USBDM_UART0_IS_DEFINED
/**
 * Peripheral information for UART, Universal Asynchronous Receiver/Transmitter.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Uart0Info {
public:
   // Template:uart0_mk21fa12_c7816

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = UART0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<UART_Type> uart = baseAddress;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = true;

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = UART0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 1;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_Normal;

   /** 
    *  Enable clock to Uart0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableUart0Clock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_UART0_MASK;
#endif
   }

   /** 
    *  Disable clock to Uart0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableUart0Clock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_UART0_MASK;
#endif
   }

   //! Indicates whether the UART needs a write to clear status errors
   static constexpr bool statusNeedsWrite = false;

   //! Default Baud rate used if not explicitly given
   static constexpr uint32_t defaultBaudRate = 115200;

   //! Default buffer size for receive queue when interrupt driven
   static constexpr unsigned receiveBufferSize = 20;

   //! Default buffer size for transmit queue when interrupt driven
   static constexpr unsigned transmitBufferSize = 1000;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static inline uint32_t getInputClockFrequency() {
      return SimInfo::getUart0Clock();
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 4;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

