podonoghue/usbdm-kinetis/Firmware/bdm_kinetis_mk22f/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: VREF_OUT             = VREF_OUT(p17)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group VREF_Group
 * @}
 */
/**
 * @addtogroup WDOG_Group WDOG, Watchdog Timer
 * @brief Abstraction for Watchdog Timer
 * @{
 */
#define USBDM_WDOG_IS_DEFINED
/**
 * Peripheral information for WDOG, Watchdog Timer.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class WdogInfo {
public:
   // Template:wdog_mk

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = WDOG_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<WDOG_Type> wdog = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = WDOG_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getInputClockFrequency() {
   
      switch(wdog->STCTRLH&WDOG_STCTRLH_CLKSRC_MASK) {
      default:
      case WDOG_STCTRLH_CLKSRC(0): return PmcInfo::getLpoClock(); // LPO
      case WDOG_STCTRLH_CLKSRC(1): return SystemBusClock;         // Alt = System Bus Clock
      }
   }

};

/** 
 * End group WDOG_Group
 * @}
 */
/** 
 * End group USBDM_Group
 * @}
 */

} // End namespace USBDM


// GPIO definitions are needed generally
#include "gpio.h"

///
/// @page PinSummary Pin Mapping
///
/// @section PinsByPinName Pins by Pin Name
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  ADC0_DM0       |                               | ADC0_DM0                                           | p10                       | Id
///  ADC0_DM0       | Identify                      | ADC0_SE19                                          | p10                       | -
///  ADC0_DP0       |                               | ADC0_DP0                                           | p9                        | N/C
///  ADC1_DM0       |                               | ADC1_DM0                                           | p12                       | N/C
///  ADC1_DP0       |                               | ADC1_DP0                                           | p11                       | N/C
///  DAC0_OUT       | -                             | DAC0_OUT                                           | p18                       | N/C
///  EXTAL32        | -                             | EXTAL32                                            | p20                       | N/C
///  PTA0           |                               | SWD_CLK                                            | p22                       | SWDCLK
///  PTA1           | -                             | UART0_RX                                           | p23                       | Debug_Rx
///  PTA2           | -                             | UART0_TX                                           | p24                       | Debug_Tx
///  PTA3           |                               | SWD_DIO                                            | p25                       | SWDIO
///  PTB0           | TPa1                          | GPIOB_0                                            | p35                       | TPa1
///  PTB1           | TPa2                          | GPIOB_1                                            | p36                       | TPa2
///  PTB2           | TVdd_Measure                  | ADC0_SE12                                          | p37                       | Vbdm
///  PTB3           | TVdd_Led                      | GPIOB_3                                            | p38                       | TVddLed
///  PTC0           | Reset_Dir                     | GPIOC_0                                            | p43                       | RST_DIR
///  PTC1           | Reset_IO                      | GPIOC_1                                            | p44                       | RST_IO
///  PTC2           | SwdDir                        | SPI0_PCS2                                          | p45                       | BKGD/SWD_DIR
///  PTC3           | BkgdDir                       | FTM0_CH2                                           | p46                       | BKGD/SWD_DIR
///  PTC4           | Swd_Enable                    | GPIOC_4                                            | p49                       | SWD_EN
///  PTC5           | SwdClk                        | SPI0_SCK                                           | p50                       | SWCLK_O
///  PTC6           | SwdDout                       | SPI0_SOUT                                          | p51                       | BKGD/SWD_O
///  PTC7           | TVdd_Mon                      | CMP0_IN1                                           | p52                       | Vbdm
///  PTD0           | TVdd_Fault                    | GPIOD_0                                            | p57                       | Vdd_Flt
///  PTD1           | TVdd_Enable                   | GPIOD_1                                            | p58                       | Vdd_En
///  PTD3           | SwdDin                        | SPI0_SIN                                           | p60                       | BKGD/SWD_I
///  PTD4           | BkgdIn                        | FTM0_CH4                                           | p61                       | BKGD/SWD_I
///  PTD6           | BkgdOut                       | FTM0_CH6                                           | p63                       | BKGD/SWD_O
///  PTD7           | Usb_Led                       | GPIOD_7                                            | p64                       | USB_LED
///  PTE0           | -                             | UART1_TX                                           | p1                        | DBG_Tx
///  PTE1           | -                             | UART1_RX                                           | p2                        | DBG_Rx
///  RESET_b        |                               | RESET_b                                            | p34                       | RESETb
///  USB0_DM        | -                             | USB0_DM                                            | p6                        | USB_DM
///  USB0_DP        | -                             | USB0_DP                                            | p5                        | USB_DP
///  VBAT           | -                             | VBAT                                               | p21                       | 3V3
///  VDD1           | -                             | VDD1                                               | p3                        | 3V3
///  VDD3           | -                             | VDD3                                               | p30                       | 3V3
///  VDDA           | -                             | VDDA                                               | p13                       | 3V3
///  VOUT33         | -                             | VOUT33                                             | p7                        | 3V3
///  VREFH          | -                             | VREFH                                              | p14                       | 3V3
///  VREF_OUT       | -                             | VREF_OUT                                           | p17                       | N/C
///  VREGIN         | -                             | VREGIN                                             | p8                        | 5V
///  VSS1           | -                             | VSS1                                               | p4                        | Vss
///  VSS3           | -                             | VSS3                                               | p31                       | Vss
///  VSSA           | -                             | VSSA                                               | p16                       | Vss
///  XTAL32         | -                             | XTAL32                                             | p19                       | N/C
///
///
/// @section PinsByLocation Pins by Location
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  PTE0           | -                             | UART1_TX                                           | p1                        | DBG_Tx
///  PTE1           | -                             | UART1_RX                                           | p2                        | DBG_Rx
///  VDD1           | -                             | VDD1                                               | p3                        | 3V3
///  VSS1           | -                             | VSS1                                               | p4                        | Vss
///  USB0_DP        | -                             | USB0_DP                                            | p5                        | USB_DP
///  USB0_DM        | -                             | USB0_DM                                            | p6                        | USB_DM
///  VOUT33         | -                             | VOUT33                                             | p7                        | 3V3
///  VREGIN         | -                             | VREGIN                                             | p8                        | 5V
///  ADC0_DP0       |                               | ADC0_DP0                                           | p9                        | N/C
///  ADC0_DM0       |                               | ADC0_DM0                                           | p10                       | Id
///  ADC0_DM0       | Identify                      | ADC0_SE19                                          | p10                       | -
///  ADC1_DP0       |                               | ADC1_DP0                                           | p11                       | N/C
///  ADC1_DM0       |                               | ADC1_DM0                                           | p12                       | N/C
///  VDDA           | -                             | VDDA                                               | p13                       | 3V3
///  VREFH          | -                             | VREFH                                              | p14                       | 3V3
///  VSSA           | -                             | VSSA                                               | p16                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p17                       | N/C
///  DAC0_OUT       | -                             | DAC0_OUT                                           | p18                       | N/C
///  XTAL32         | -                             | XTAL32                                             | p19                       | N/C
///  EXTAL32        | -                             | EXTAL32                                            | p20                       | N/C
///  VBAT           | -                             | VBAT                                               | p21                       | 3V3
///  PTA0           |                               | SWD_CLK                                            | p22                       | SWDCLK
///  PTA1           | -                             | UART0_RX                                           | p23                       | Debug_Rx
///  PTA2           | -                             | UART0_TX                                           | p24                       | Debug_Tx
///  PTA3           |                               | SWD_DIO                                            | p25                       | SWDIO
///  VDD3           | -                             | VDD3                                               | p30                       | 3V3
///  VSS3           | -                             | VSS3                                               | p31                       | Vss
///  RESET_b        |                               | RESET_b                                            | p34                       | RESETb
///  PTB0           | TPa1                          | GPIOB_0                                            | p35                       | TPa1
///  PTB1           | TPa2                          | GPIOB_1                                            | p36                       | TPa2
///  PTB2           | TVdd_Measure                  | ADC0_SE12                                          | p37                       | Vbdm
///  PTB3           | TVdd_Led                      | GPIOB_3                                            | p38                       | TVddLed
///  PTC0           | Reset_Dir                     | GPIOC_0                                            | p43                       | RST_DIR
///  PTC1           | Reset_IO                      | GPIOC_1                                            | p44                       | RST_IO
///  PTC2           | SwdDir                        | SPI0_PCS2                                          | p45                       | BKGD/SWD_DIR
///  PTC3           | BkgdDir                       | FTM0_CH2                                           | p46                       | BKGD/SWD_DIR
///  PTC4           | Swd_Enable                    | GPIOC_4                                            | p49                       | SWD_EN
///  PTC5           | SwdClk                        | SPI0_SCK                                           | p50                       | SWCLK_O
///  PTC6           | SwdDout                       | SPI0_SOUT                                          | p51                       | BKGD/SWD_O
///  PTC7           | TVdd_Mon                      | CMP0_IN1                                           | p52                       | Vbdm
///  PTD0           | TVdd_Fault                    | GPIOD_0                                            | p57                       | Vdd_Flt
///  PTD1           | TVdd_Enable                   | GPIOD_1                                            | p58                       | Vdd_En
///  PTD3           | SwdDin                        | SPI0_SIN                                           | p60                       | BKGD/SWD_I
///  PTD4           | BkgdIn                        | FTM0_CH4                                           | p61                       | BKGD/SWD_I
///  PTD6           | BkgdOut                       | FTM0_CH6                                           | p63                       | BKGD/SWD_O
///  PTD7           | Usb_Led                       | GPIOD_7                                            | p64                       | USB_LED
///
///
/// @section PinsByFunction Pins by Peripheral
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  ADC0_DM0       |                               | ADC0_DM0                                           | p10                       | Id
///  ADC0_DP0       |                               | ADC0_DP0                                           | p9                        | N/C
///  PTB2           | TVdd_Measure                  | ADC0_SE12                                          | p37                       | Vbdm
///  ADC0_DM0       | Identify                      | ADC0_SE19                                          | p10                       | -
///  ADC1_DM0       |                               | ADC1_DM0                                           | p12                       | N/C
///  ADC1_DP0       |                               | ADC1_DP0                                           | p11                       | N/C
///  PTC7           | TVdd_Mon                      | CMP0_IN1                                           | p52                       | Vbdm
///  DAC0_OUT       | -                             | DAC0_OUT                                           | p18                       | N/C
///  EXTAL32        | -                             | EXTAL32                                            | p20                       | N/C
///  PTC3           | BkgdDir                       | FTM0_CH2                                           | p46                       | BKGD/SWD_DIR
///  PTD4           | BkgdIn                        | FTM0_CH4                                           | p61                       | BKGD/SWD_I
///  PTD6           | BkgdOut                       | FTM0_CH6                                           | p63                       | BKGD/SWD_O
///  PTB0           | TPa1                          | GPIOB_0                                            | p35                       | TPa1
///  PTB1           | TPa2                          | GPIOB_1                                            | p36                       | TPa2
///  PTB3           | TVdd_Led                      | GPIOB_3                                            | p38                       | TVddLed
///  PTC0           | Reset_Dir                     | GPIOC_0                                            | p43                       | RST_DIR
///  PTC1           | Reset_IO                      | GPIOC_1                                            | p44                       | RST_IO
///  PTC4           | Swd_Enable                    | GPIOC_4                                            | p49                       | SWD_EN
///  PTD0           | TVdd_Fault                    | GPIOD_0                                            | p57                       | Vdd_Flt
///  PTD1           | TVdd_Enable                   | GPIOD_1                                            | p58                       | Vdd_En
///  PTD7           | Usb_Led                       | GPIOD_7                                            | p64                       | USB_LED
///  RESET_b        |                               | RESET_b                                            | p34                       | RESETb
///  PTC2           | SwdDir                        | SPI0_PCS2                                          | p45                       | BKGD/SWD_DIR
///  PTC5           | SwdClk                        | SPI0_SCK                                           | p50                       | SWCLK_O
///  PTD3           | SwdDin                        | SPI0_SIN                                           | p60                       | BKGD/SWD_I
///  PTC6           | SwdDout                       | SPI0_SOUT                                          | p51                       | BKGD/SWD_O
///  PTA0           |                               | SWD_CLK                                            | p22                       | SWDCLK
///  PTA3           |                               | SWD_DIO                                            | p25                       | SWDIO
///  PTA1           | -                             | UART0_RX                                           | p23                       | Debug_Rx
///  PTA2           | -                             | UART0_TX                                           | p24                       | Debug_Tx
///  PTE1           | -                             | UART1_RX                                           | p2                        | DBG_Rx
///  PTE0           | -                             | UART1_TX                                           | p1                        | DBG_Tx
///  USB0_DM        | -                             | USB0_DM                                            | p6                        | USB_DM
///  USB0_DP        | -                             | USB0_DP                                            | p5                        | USB_DP
///  VBAT           | -                             | VBAT                                               | p21                       | 3V3
///  VDD1           | -                             | VDD1                                               | p3                        | 3V3
///  VDD3           | -                             | VDD3                                               | p30                       | 3V3
///  VDDA           | -                             | VDDA                                               | p13                       | 3V3
///  VOUT33         | -                             | VOUT33                                             | p7                        | 3V3
///  VREFH          | -                             | VREFH                                              | p14                       | 3V3
///  VREF_OUT       | -                             | VREF_OUT                                           | p17                       | N/C
///  VREGIN         | -                             | VREGIN                                             | p8                        | 5V
///  VSS1           | -                             | VSS1                                               | p4                        | Vss
///  VSS3           | -                             | VSS3                                               | p31                       | Vss
///  VSSA           | -                             | VSSA                                               | p16                       | Vss
///  XTAL32         | -                             | XTAL32                                             | p19                       | N/C
///
///

#endif /* PROJECT_HEADERS_PIN_MAPPING_H */
